blascarr/DomoLamp/DomoLamp_ESP32/ESPAsync_DomoManager/src/ESPAsync_WiFiManager.hpp
/****************************************************************************************************************************
  ESPAsync_WiFiManager.hpp
  For ESP8266 / ESP32 boards

  ESPAsync_WiFiManager is a library for the ESP8266/Arduino platform, using (ESP)AsyncWebServer to enable easy
  configuration and reconfiguration of WiFi credentials using a Captive Portal.

  Modified from 
  1. Tzapu               (https://github.com/tzapu/WiFiManager)
  2. Ken Taylor          (https://github.com/kentaylor)
  3. Alan Steremberg     (https://github.com/alanswx/ESPAsyncWiFiManager)
  4. Khoi Hoang          (https://github.com/khoih-prog/ESP_WiFiManager)

  Built by Khoi Hoang https://github.com/khoih-prog/ESPAsync_WiFiManager
  Licensed under MIT license
  
  Version: 1.12.2

  Version Modified By  Date      Comments
  ------- -----------  ---------- -----------
  1.0.11  K Hoang      21/08/2020 Initial coding to use (ESP)AsyncWebServer instead of (ESP8266)WebServer. Bump up to v1.0.11
                                  to sync with ESP_WiFiManager v1.0.11
  ...
  1.10.0  K Hoang      29/12/2021 Fix `multiple-definitions` linker error and weird bug related to src_cpp
  1.11.0  K Hoang      17/01/2022 Enable compatibility with old code to include only ESP_WiFiManager.h
  1.12.0  K Hoang      10/02/2022 Add support to new ESP32-S3
  1.12.1  K Hoang      11/02/2022 Add LittleFS support to ESP32-C3. Use core LittleFS instead of Lorol's LITTLEFS for v2.0.0+
  1.12.2  K Hoang      13/03/2022 Optimize code by using passing by `reference` instead of by `value`
 *****************************************************************************************************************************/

#pragma once

#ifndef ESPAsync_WiFiManager_hpp
#define ESPAsync_WiFiManager_hpp

#if !( defined(ESP8266) ||  defined(ESP32) )
  #error This code is intended to run on the ESP8266 or ESP32 platform! Please check your Tools->Board setting.
#elif ( ARDUINO_ESP32S2_DEV || ARDUINO_FEATHERS2 || ARDUINO_ESP32S2_THING_PLUS || ARDUINO_MICROS2 || \
        ARDUINO_METRO_ESP32S2 || ARDUINO_MAGTAG29_ESP32S2 || ARDUINO_FUNHOUSE_ESP32S2 || \
        ARDUINO_ADAFRUIT_FEATHER_ESP32S2_NOPSRAM )
  #if (_ESPASYNC_WIFIMGR_LOGLEVEL_ > 3)      
		#warning Using ESP32_S2. To follow library instructions to install esp32-s2 core and WebServer Patch
		#warning You have to select HUGE APP or 1.9-2.0 MB APP to be able to run Config Portal. Must use PSRAM
  #endif
  
  #define USING_ESP32_S2        true
  
#elif ( ARDUINO_ESP32C3_DEV )
	#if (_ESPASYNC_WIFIMGR_LOGLEVEL_ > 3) 
		#if ( defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 2) )
		  #warning Using ESP32_C3 using core v2.0.0+. Either LittleFS, SPIFFS or EEPROM OK
		#else
		  #warning Using ESP32_C3 using core v1.0.6-. To follow library instructions to install esp32-c3 core. Only SPIFFS and EEPROM OK
		#endif
    
 		#warning You have to select Flash size 2MB and Minimal APP (1.3MB + 700KB) for some boards
  
  #endif
  
  #define USING_ESP32_C3        true
  
#elif ( defined(ARDUINO_ESP32S3_DEV) || defined(ARDUINO_ESP32_S3_BOX) || defined(ARDUINO_TINYS3) || \
        defined(ARDUINO_PROS3) || defined(ARDUINO_FEATHERS3) )

	#if (_ESPASYNC_WIFIMGR_LOGLEVEL_ > 3)    
		#warning Using ESP32_S3. To install esp32-s3-support branch if using core v2.0.2-
	#endif
  
  #define USING_ESP32_S3        true   
#endif

#define ESP_ASYNC_WIFIMANAGER_VERSION           "ESPAsync_WiFiManager v1.12.2"

#define ESP_ASYNC_WIFIMANAGER_VERSION_MAJOR     1
#define ESP_ASYNC_WIFIMANAGER_VERSION_MINOR     12
#define ESP_ASYNC_WIFIMANAGER_VERSION_PATCH     2

#define ESP_ASYNC_WIFIMANAGER_VERSION_INT      1012002

#if ESP8266
  #if (ARDUINO_ESP8266_GIT_VER == 0xcf6ff4c4)
    #define USING_ESP8266_CORE_VERSION    30002
    #define ESP8266_CORE_VERSION          "ESP8266 core v3.0.2"
    
    #if (_ESPASYNC_WIFIMGR_LOGLEVEL_ > 3) 
    	#warning USING_ESP8266_CORE_VERSION "3.0.2"
    #endif
    
  #elif (ARDUINO_ESP8266_GIT_VER == 0xcbf44fb3)
    #define USING_ESP8266_CORE_VERSION    30001
    #define ESP8266_CORE_VERSION          "ESP8266 core v3.0.1"
    
    #if (_ESPASYNC_WIFIMGR_LOGLEVEL_ > 3) 
    	#warning USING_ESP8266_CORE_VERSION "3.0.1"
    #endif
    
  #elif (ARDUINO_ESP8266_GIT_VER == 0xefb0341a)
    #define USING_ESP8266_CORE_VERSION    30000
    #define ESP8266_CORE_VERSION          "ESP8266 core v3.0.0"
    
    #if (_ESPASYNC_WIFIMGR_LOGLEVEL_ > 3) 
    	#warning USING_ESP8266_CORE_VERSION "3.0.0"
    #endif
    
  #elif (ARDUINO_ESP8266_GIT_VER == 0x2843a5ac)
    #define USING_ESP8266_CORE_VERSION    20704
    #define ESP8266_CORE_VERSION          "ESP8266 core v2.7.4"
    
    #if (_ESPASYNC_WIFIMGR_LOGLEVEL_ > 3) 
    	#warning USING_ESP8266_CORE_VERSION "2.7.4"
    #endif
    
  #elif (ARDUINO_ESP8266_GIT_VER == 0x5d3af165)
    #define USING_ESP8266_CORE_VERSION    20703
    #define ESP8266_CORE_VERSION          "ESP8266 core v2.7.3"
    
    #if (_ESPASYNC_WIFIMGR_LOGLEVEL_ > 3) 
    	#warning USING_ESP8266_CORE_VERSION "2.7.3"
    #endif
    
  #elif (ARDUINO_ESP8266_GIT_VER == 0x39c79d9b)
    #define USING_ESP8266_CORE_VERSION    20702
    #define ESP8266_CORE_VERSION          "ESP8266 core v2.7.2"
    
    #if (_ESPASYNC_WIFIMGR_LOGLEVEL_ > 3)
    	#warning USING_ESP8266_CORE_VERSION "2.7.2"
    #endif
    
  #elif (ARDUINO_ESP8266_GIT_VER == 0xa5432625)
    #define USING_ESP8266_CORE_VERSION    20701
    #define ESP8266_CORE_VERSION          "ESP8266 core v2.7.1"
    
    #if (_ESPASYNC_WIFIMGR_LOGLEVEL_ > 3) 
    	#warning USING_ESP8266_CORE_VERSION "2.7.1"
    #endif
    
  #elif (ARDUINO_ESP8266_GIT_VER == 0x3d128e5c)
    #define USING_ESP8266_CORE_VERSION    20603
    #define ESP8266_CORE_VERSION          "ESP8266 core v2.6.3"
    
    #if (_ESPASYNC_WIFIMGR_LOGLEVEL_ > 3) 
    	#warning USING_ESP8266_CORE_VERSION "2.6.3"
    #endif
    
  #elif (ARDUINO_ESP8266_GIT_VER == 0x482516e3)
    #define USING_ESP8266_CORE_VERSION    20602
    #define ESP8266_CORE_VERSION          "ESP8266 core v2.6.2"
    
    #if (_ESPASYNC_WIFIMGR_LOGLEVEL_ > 3) 
    	#warning USING_ESP8266_CORE_VERSION "2.6.2"
    #endif
    
  #elif (ARDUINO_ESP8266_GIT_VER == 0x482516e3)
    #define USING_ESP8266_CORE_VERSION    20601
    #define ESP8266_CORE_VERSION          "ESP8266 core v2.6.1"
    
    #if (_ESPASYNC_WIFIMGR_LOGLEVEL_ > 3) 
    	#warning USING_ESP8266_CORE_VERSION "2.6.1"
    #endif
    
  #elif (ARDUINO_ESP8266_GIT_VER == 0x643ec203)
    #define USING_ESP8266_CORE_VERSION    20600
    #define ESP8266_CORE_VERSION          "ESP8266 core v2.6.0"
    
    #if (_ESPASYNC_WIFIMGR_LOGLEVEL_ > 3) 
    	#warning USING_ESP8266_CORE_VERSION "2.6.0"
    #endif
    
  #elif (ARDUINO_ESP8266_GIT_VER == 0x8b899c12)
    #define USING_ESP8266_CORE_VERSION    20502
    #define ESP8266_CORE_VERSION          "ESP8266 core v2.5.2"
    
    #if (_ESPASYNC_WIFIMGR_LOGLEVEL_ > 3) 
    	#warning USING_ESP8266_CORE_VERSION "2.5.2"
    #endif
    
  #elif (ARDUINO_ESP8266_GIT_VER == 0x00000000)
    #define USING_ESP8266_CORE_VERSION    20402
    #define ESP8266_CORE_VERSION          "ESP8266 core v2.4.2"
    
    #if (_ESPASYNC_WIFIMGR_LOGLEVEL_ > 3) 
    	#warning USING_ESP8266_CORE_VERSION "2.4.2"
    #endif
    
  #elif (ARDUINO_ESP8266_GIT_VER == 0x643ec203)
    #define USING_ESP8266_CORE_VERSION    0
    #define ESP8266_CORE_VERSION          "ESP8266 core too old"
    #warning USING_ESP8266_CORE_VERSION "0.0.0"
  #else
    #define USING_ESP8266_CORE_VERSION    999999
    #define ESP8266_CORE_VERSION          "ESP8266 core unknown"
    #warning USING_ESP8266_CORE_VERSION "x.y.z"  
  #endif
#endif

#include "ESPAsync_WiFiManager_Debug.h"

