blascarr/DomoLamp/DomoLamp_ESP32/ESPAsync_DomoManager/src/ESPAsync_WiFiManager.hpp
//KH, for ESP32
#ifdef ESP8266
  #include <ESP8266WiFi.h>
  #include <ESPAsyncWebServer.h>
#else		//ESP32
  #include <WiFi.h>
  #include <ESPAsyncWebServer.h>
#endif

#include <DNSServer.h>
#include <memory>
#undef min
#undef max
#include <algorithm>

// fix crash on ESP32 (see https://github.com/alanswx/ESPAsyncWiFiManager/issues/44)
#if defined(ESP8266)
  typedef int     wifi_ssid_count_t;
#else
  typedef int16_t wifi_ssid_count_t;
#endif

//KH, for ESP32
#ifdef ESP8266
  extern "C"
  {
    #include "user_interface.h"
  }
  
  #define ESP_getChipId()   (ESP.getChipId())
#else		//ESP32
  #include <esp_wifi.h>
  #define ESP_getChipId()   ((uint32_t)ESP.getEfuseMac())
#endif

typedef struct
{
  IPAddress _ap_static_ip;
  IPAddress _ap_static_gw;
  IPAddress _ap_static_sn;

}  WiFi_AP_IPConfig;

// Thanks to @Amorphous for the feature and code
// (https://community.blynk.cc/t/esp-wifimanager-for-esp32-and-esp8266/42257/13)
// To enable to configure from sketch
#if !defined(USE_CONFIGURABLE_DNS)
  #define USE_CONFIGURABLE_DNS        false
#endif

typedef struct
{
  IPAddress _sta_static_ip;
  IPAddress _sta_static_gw;
  IPAddress _sta_static_sn;
  IPAddress _sta_static_dns1;
  IPAddress _sta_static_dns2;
}  WiFi_STA_IPConfig;

#define WFM_LABEL_BEFORE 1
#define WFM_LABEL_AFTER 2
#define WFM_NO_LABEL 0

/** Handle CORS in pages */
// Default false for using only whenever necessary to avoid security issue when using CORS (Cross-Origin Resource Sharing)
#ifndef USING_CORS_FEATURE
  // Contributed by AlesSt (https://github.com/AlesSt) to solve AJAX CORS protection problem of API redirects on client side
  // See more in https://github.com/khoih-prog/ESP_WiFiManager/issues/27 and https://en.wikipedia.org/wiki/Cross-origin_resource_sharing
  #define USING_CORS_FEATURE     false
#endif

#ifndef TIME_BETWEEN_MODAL_SCANS
  // Default to 30s
  #define TIME_BETWEEN_MODAL_SCANS          120000UL
#endif

#ifndef TIME_BETWEEN_MODELESS_SCANS
  // Default to 60s
  #define TIME_BETWEEN_MODELESS_SCANS       120000UL
#endif

//KH
// Mofidy HTTP_HEAD to WM_HTTP_HEAD_START to avoid conflict in Arduino esp8266 core 2.6.0+
const char WM_HTTP_200[] PROGMEM            = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\n\r\n";
const char WM_HTTP_HEAD_START[] PROGMEM     = "<!DOCTYPE html><html lang='en'><head><meta name='viewport' content='width=device-width, initial-scale=1, user-scalable=no'/><title>{v}</title>";

const char WM_HTTP_STYLE[] PROGMEM = "<style>div{padding:2px;font-size:1em;}body,textarea,input,select{background: 0;border-radius: 0;font: 16px sans-serif;margin: 0}textarea,input,select{outline: 0;font-size: 14px;border: 1px solid #ccc;padding: 8px;width: 90%}.btn a{text-decoration: none}.container{margin: auto;width: 90%}@media(min-width:1200px){.container{margin: auto;width: 30%}}@media(min-width:768px) and (max-width:1200px){.container{margin: auto;width: 50%}}.btn,h2{font-size: 2em}h1{font-size: 3em}.btn{background: #0ae;border-radius: 4px;border: 0;color: #fff;cursor: pointer;display: inline-block;margin: 2px 0;padding: 10px 14px 11px;width: 100%}.btn:hover{background: #09d}.btn:active,.btn:focus{background: #08b}label>*{display: inline}form>*{display: block;margin-bottom: 10px}textarea:focus,input:focus,select:focus{border-color: #5ab}.msg{background: #def;border-left: 5px solid #59d;padding: 1.5em}.q{float: right;width: 64px;text-align: right}.l{background: url('data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAACAAAAAgCAMAAABEpIrGAAAALVBMVEX///8EBwfBwsLw8PAzNjaCg4NTVVUjJiZDRUUUFxdiZGSho6OSk5Pg4eFydHTCjaf3AAAAZElEQVQ4je2NSw7AIAhEBamKn97/uMXEGBvozkWb9C2Zx4xzWykBhFAeYp9gkLyZE0zIMno9n4g19hmdY39scwqVkOXaxph0ZCXQcqxSpgQpONa59wkRDOL93eAXvimwlbPbwwVAegLS1HGfZAAAAABJRU5ErkJggg==') no-repeat left center;background-size: 1em}input[type='checkbox']{float: left;width: 20px}.table td{padding:.5em;text-align:left}.table tbody>:nth-child(2n-1){background:#ddd}fieldset{border-radius:0.5rem;margin:0px;}</style>";

// KH, update from v1.1.0
const char WM_HTTP_SCRIPT[] PROGMEM = "<script>function c(l){document.getElementById('s').value=l.innerText||l.textContent;document.getElementById('p').focus();document.getElementById('s1').value=l.innerText||l.textContent;document.getElementById('p1').focus();document.getElementById('timezone').value=timezone.name();}</script>";

// Lamp Controller Model
const char BOOTSTRAP_HTTP_STYLE[] PROGMEM = "<link href='https://cdn.jsdelivr.net/npm/bootstrap@5.2.0-beta1/dist/css/bootstrap.min.css' rel='stylesheet'>";
const char JQUERY_HTTP_SCRIPT[] PROGMEM = "<script src='https://ajax.googleapis.com/ajax/libs/jquery/3.4.1/jquery.min.js'></script>";
const char JSON2HTML_HTTP_SCRIPT[] PROGMEM = "<script src='https://cdnjs.cloudflare.com/ajax/libs/json2html/2.1.0/json2html.min.js'></script>";
const char BOOTSTRAP_HTTP_SCRIPT[] PROGMEM = "<script src='https://cdn.jsdelivr.net/npm/bootstrap@5.2.0-beta1/dist/js/bootstrap.bundle.min.js'></script>";
const char LAMPPAGE_HTTP_SCRIPT[] PROGMEM = "<script src='https://indooruwb.s3.eu-west-3.amazonaws.com/anchorlist_loader.js'></script>";
const char LAMPPAGE_BODY[] PROGMEM = "<body><div id='lm'></div><div id='cs'><input id='cp' type='color' value='#00ff00' list='ps'></div><div id='sliders'><input id='ds' type='range' min='0' max='2000' value='50'><div id='dl'>50</div><input id='bs' type='range' min='0' max='100' value='50'><div id='bl'>50</div></div><div><button id='sb'> Send </button></div><div><button id='wo'> Wifi OFF </button></div></body>";
const char LAMPPAGE_SCRIPT[] PROGMEM = "<script>let lm=[['Light ON','COLOR'],['Light OFF','OFF'],['Rainbow','RAINBOW'],['Fade','FADE'],['Blink','BLINK'],['Landing','LANDING'],['UpLanding','UPLANDING'],['DownLanding','DOWNLANDING']];let colorInput=domget('cp');let modeInput=domget('lm');window.addEventListener('input',()=>{domlabelvalue('dl','ds');domlabelvalue('bl','bs')});window.addEventListener('load',function(event){const defaultColors=['#00ffff','#00ff00','#0000ff','#ffff00','#ff00ff','#ff0000'];optionConstructor(defaultColors,'datalist','ps','cs');optionConstructor(lm,'select','sm','lm');domget('sb').addEventListener('click',domoData);domget('wo').addEventListener('click',wifioff)});function optionConstructor(optionlist,elementype,id,into){const optionContainer=document.createElement(elementype);optionContainer.setAttribute('id',id);optionlist.forEach((el)=>{const optionelement=document.createElement('option');let optionlabel=el;if(typeof(el)=='object'){optionelement.setAttribute('value',el[1]);optionlabel=el[0]}optionelement.innerHTML=optionlabel;optionContainer.appendChild(optionelement)});domget(into).appendChild(optionContainer)}function domlabelvalue(id,label){domget(id).innerHTML=domvalue(label)}function domvalue(dom){const v=domget(dom).value;if(parseInt(v)>0){return Number(v)}return v}function domget(dom){return document.getElementById(dom)}function RGBColor(){const cv=colorInput.value;function fc(v,b,e){return parseInt('0x'+cv.slice(b,e))};const r=fc(cv,1,3);const g=fc(cv,3,5);const b=fc(cv,5,7);return{r,g,b}}function domoData(){let RGBColour=RGBColor();let lampmode=domvalue('sm');let brightness_value=domvalue('bs');let delay=domvalue('ds');let dataJSON={effect:lampmode,latency:delay,brightness:brightness_value,RGBColor:[RGBColour.r,RGBColour.g,RGBColour.b]};console.log(dataJSON);var xhr=new XMLHttpRequest();xhr.open('GET','domo?LampData='+JSON.stringify(dataJSON),true);xhr.send()}function wifioff(){}</script>";
//////

// To permit disable or configure NTP from sketch
#ifndef USE_ESP_WIFIMANAGER_NTP
  // To enable NTP config
  #define USE_ESP_WIFIMANAGER_NTP     true
#endif

#if USE_ESP_WIFIMANAGER_NTP

#include "utils/TZ.h"

const char WM_HTTP_SCRIPT_NTP_MSG[] PROGMEM = "<p>Your Timezone is : <b><label id='timezone' name='timezone'></b><script>document.getElementById('timezone').innerHTML=timezone.name();document.getElementById('timezone').value=timezone.name();</script></p>";
const char WM_HTTP_SCRIPT_NTP_HIDDEN[] PROGMEM = "<p><input type='hidden' id='timezone' name='timezone'><script>document.getElementById('timezone').innerHTML=timezone.name();document.getElementById('timezone').value=timezone.name();</script></p>";

